---
type: Grid
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# Grid

`Autodesk.Revit.DB.Grid` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Method | GetExtents | 2013 | `public Outline GetExtents ()` |
| Method | SetVerticalExtents | 2016 | `public void SetVerticalExtents ( double bottom , double top )` |
| Property | Curve | — | `public Curve Curve { get ; }` |
| Property | IsCurved | — | `public bool IsCurved { get ; }` |
| Property | Parameter | — | `` |